PKS1C/src/Documents/ЗаявкаНаРемонт/ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРемонт</name>
  <basedOn>Document.ЗаявкаНаРемонт</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IMEI</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПретензииКРаботе</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийПредставитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаТоваровИУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НахождениеУстройства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокПитания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СумкаИлиЧехол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаключениеСпециалиста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗИПиУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕденицаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PKS1C/src/Documents/ЗаявкаНаРемонт/ManagerModule.bsl
Процедура ТалонНаРемонт(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ТалонНаРемонт)
	Макет = Документы.ЗаявкаНаРемонт.ПолучитьМакет("ТалонНаРемонт");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРемонт.IMEI,
	|	ЗаявкаНаРемонт.ВидОборудования,
	|	ЗаявкаНаРемонт.Дата,
	|	ЗаявкаНаРемонт.Клиент.Контрагент.НаименованиеПолное КАК Клиент,
	|	ЗаявкаНаРемонт.Модель,
	|	ЗаявкаНаРемонт.Номер,
	|	ЗаявкаНаРемонт.ПретензииКРаботе,
	|	ЗаявкаНаРемонт.Производитель,
	|	ЗаявкаНаРемонт.СерийныйНомер,
	|	ЗаявкаНаРемонт.ТехническийПредставитель,
	|	ЗаявкаНаРемонт.Характеристика,
	|	ЗаявкаНаРемонт.ЗИПиУслуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма
	|	),
	|	ЗаявкаНаРемонт.Оплата.(
	|		Оплата,
	|		ДатаПлатежа
	|	),
	|	ЗаявкаНаРемонт.Клиент.НомерТелефона КАК Телефон,
	|	ЗаявкаНаРемонт.НахождениеУстройства,
	|	ЗаявкаНаРемонт.БлокПитания,
	|	ЗаявкаНаРемонт.СумкаИлиЧехол
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьЗИПиУслугиШапка = Макет.ПолучитьОбласть("ЗИПиУслугиШапка");
	//ОбластьЗИПиУслуги = Макет.ПолучитьОбласть("ЗИПиУслуги");
	ОбластьОплатаШапка = Макет.ПолучитьОбласть("ОплатаШапка");
	ОбластьОплата = Макет.ПолучитьОбласть("Оплата");
	
	ОбластьКлиентШапка = Макет.ПолучитьОбласть("КлиентШапка");
//	ОбластьКлиент = Макет.ПолучитьОбласть("Клиент");
	
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		//ТабДок.Вывести(ОбластьЗИПиУслугиШапка);
		//ВыборкаЗИПиУслуги = Выборка.ЗИПиУслуги.Выбрать();
		//Пока ВыборкаЗИПиУслуги.Следующий() Цикл
		//	ОбластьЗИПиУслуги.Параметры.Заполнить(ВыборкаЗИПиУслуги);
		//	ТабДок.Вывести(ОбластьЗИПиУслуги, ВыборкаЗИПиУслуги.Уровень());
		//КонецЦикла;
		ОбластьКлиентШапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьКлиентШапка);
		//ВыборкаКлиент = Выборка.Телефон;
		//Пока ВыборкаКлиент.Следующий() Цикл
		//	ОбластьКлиент.Параметры.Заполнить(ВыборкаКлиент);
		//	ТабДок.Вывести(ОбластьКлиент, ВыборкаКлиент.Уровень());
		//КонецЦикла;

		
		
		ТабДок.Вывести(ОбластьОплатаШапка);
		ВыборкаОплата = Выборка.Оплата.Выбрать();
		Пока ВыборкаОплата.Следующий() Цикл
			ОбластьОплата.Параметры.Заполнить(ВыборкаОплата);
			ТабДок.Вывести(ОбластьОплата, ВыборкаОплата.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура АктВыполненныхРабот(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(АктВыполненныхРабот)
	Макет = Документы.ЗаявкаНаРемонт.ПолучитьМакет("АктВыполненныхРабот");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаРемонт.IMEI КАК IMEI,
	|	ЗаявкаНаРемонт.ВидОборудования КАК ВидОборудования,
	|	ЗаявкаНаРемонт.Дата КАК Дата,
	|	ЗаявкаНаРемонт.Клиент.Контрагент.НаименованиеПолное КАК Клиент,
	|	ЗаявкаНаРемонт.Модель КАК Модель,
	|	ЗаявкаНаРемонт.Номер КАК Номер,
	|	ЗаявкаНаРемонт.Производитель КАК Производитель,
	|	ЗаявкаНаРемонт.СерийныйНомер КАК СерийныйНомер,
	|	ЗаявкаНаРемонт.Склад КАК Склад,
	|	ЗаявкаНаРемонт.СтатусЗаявки КАК СтатусЗаявки,
	|	ЗаявкаНаРемонт.СуммаОплат КАК СуммаОплат,
	|	ЗаявкаНаРемонт.ТехническийПредставитель КАК ТехническийПредставитель,
	|	ЗаявкаНаРемонт.Характеристика КАК Свойство,
	|	ЗаявкаНаРемонт.Оплата.(
	|		Оплата КАК Оплата,
	|		ДатаПлатежа КАК ДатаПлатежа
	|	) КАК Оплата,
	|	ЗаявкаНаРемонт.ЗИПиУслуги.(
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК ЗИПиУслуги
	|ИЗ
	|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	|ГДЕ
	|	ЗаявкаНаРемонт.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗИПиУслугиШапка = Макет.ПолучитьОбласть("ЗИПиУслугиШапка");
	ОбластьЗИПиУслуги = Макет.ПолучитьОбласть("ЗИПиУслуги");
	ОбластьОплатаШапка = Макет.ПолучитьОбласть("ОплатаШапка");
	ОбластьОплата = Макет.ПолучитьОбласть("Оплата");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОплатаШапка);
		ВыборкаОплата = Выборка.Оплата.Выбрать();
		Пока ВыборкаОплата.Следующий() Цикл
			ОбластьОплата.Параметры.Заполнить(ВыборкаОплата);
			ТабДок.Вывести(ОбластьОплата, ВыборкаОплата.Уровень());
		КонецЦикла;		
		
		ТабДок.Вывести(ОбластьЗИПиУслугиШапка);
		ВыборкаЗИПиУслуги = Выборка.ЗИПиУслуги.Выбрать();
		Пока ВыборкаЗИПиУслуги.Следующий() Цикл
			ОбластьЗИПиУслуги.Параметры.Заполнить(ВыборкаЗИПиУслуги);
			ТабДок.Вывести(ОбластьЗИПиУслуги, ВыборкаЗИПиУслуги.Уровень());
		КонецЦикла;
		


		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
